package main

import (
	"fmt"
	"sync"
)

// Написать программу, которая конкурентно рассчитает значение квадратов чисел взятых из массива (2,4,6,8,10) и выведет их квадраты в stdout.

var wg sync.WaitGroup // Примитив синхронизации - группа ожидания

func main() {

	array := [5]int{2, 4, 6, 8, 10}

	for _, i := range array {
		wg.Add(1) // Увеличиваем счетчик ожидания горутин
		go numberSquared(i) // создаётся отдельная горутина, добавляющая к приложению другой поток Go, отвечающий за выполнение функции на отдельном конкурентном потоке
	}
	wg.Wait() //Ждем, пока счетчик ожидаемых горутин не будет равен 0
}

// Функция для вычисления квадрата числа
func numberSquared(number int) {
	fmt.Println(number * number)
	wg.Done() // По завершению работы горутины уменьшаем значение счетчика на единицу в wg
}
