package main

import (
	"fmt"
	"time"
)

//Разработать программу, которая будет последовательно отправлять значения в канал, а с другой стороны канала — читать.
//По истечению N секунд программа должна завершаться.

func main() {
	var n int //Создали переменную для сканера

	fmt.Println("Введите N:")
	fmt.Scan(&n) //Считали данные с консоли, записали в n

	stop := time.After(time.Duration(n) * time.Second) // Ждет пока истечет время, затем отправляет текущее время в канал

	ch := make(chan string)

	go write(ch)

	go read(ch)

	<-stop // Основной поток ждет пока можно будет прочитать из канала и завершается
}

// Функция бесконечно пишет в канал
func write(ch chan string) {
	for {
		ch <- "message" //Если мы можем писать
		fmt.Println("Мы записали в канал")
	}
}

// Функция бесконечно читает из канала
func read(ch chan string) {
	for {
		<-ch
		fmt.Println("Мы прочитали из канала")
	}
}
