package main

import "fmt"

// Дана структура Human (с произвольным набором полей и методов). Реализовать встраивание методов в структуре Action от родительской структуры Human (аналог наследования).

// Встраивание в go - всраивание методов либо свойств какого-то типа в определенное поле структур (расширение основного типа)
// Это не наследование, а композиция - тип А содержит тип В, за счет чего также получает его возможности, но тип А так и остается типом А (при наследовании тип А имеет возможности и тип типа В - А явл. подтипом В)

type Human struct {
	Name string
	Age  int
}

func (h *Human) printName() {
	fmt.Println(h.Name)
}

type Action struct {
	Human
}

func main() {
	action := Action{Human{Name: "Ira", Age: 15}}

	action.Human.printName() // полный путь
	action.printName()       // shorthand. Go проверяет наличие метода printName, начиная от корня типа Action углубляясь дальше - во вложенный типы, и берет ближайшее.
}